lib/tasks/dev.rake

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  task add_default_admin: :environment do
    Admin.create!(
      email: 'admin@admin.com',
      password: DEFAULT_PASSWORD,
      password_confirmation: DEFAULT_PASSWORD
    )

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  task add_extras_admin: :environment do
    10.times do |i|
      Admin.create!(
        email: Faker::Internet.email,
        password: DEFAULT_PASSWORD,
        password_confirmation: DEFAULT_PASSWORD
      )

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  task add_default_user: :environment do
    User.create!(
      email: 'user@user.com',
      password: DEFAULT_PASSWORD,
      password_confirmation: DEFAULT_PASSWORD
    )

INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Acionamentos e controles elétricos"], ["created_at", "2019-03-31 00:47:34.324243"], ["updated_at", "2019-03-31 00:47:34.324243"]]
---
  task add_subjects: :environment do
    file_path = File.join(DEFAULT_FILES_PATH, 'subjects.txt')
    File.open(file_path,'r').each do |linha|
      Subject.create!(description: linha.strip)

SELECT "subjects".* FROM "subjects"
INSERT INTO "answers" ("description", "question_id", "correct", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Accusantium optio et et."], ["question_id", 1], ["correct", 1], ["created_at", "2019-03-31 01:00:38.338464"], ["updated_at", "2019-03-31 01:00:38.338464"]]
INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  task add_questions: :environment do
    Subject.all.each do |subject|
      rand(5..10).times do |i|
        question_params = { description: "#{Faker::Lorem.paragraph} #{Faker::Lorem.question}", subject: subject,  answers_attributes: [] }
        rand(2..5).times do |j|
          question_params[:answers_attributes] << { description: Faker::Lorem.sentence, correct: false }
        end
        question_params[:answers_attributes].sample[:correct] = true;
        Question.create!(question_params)